k6/results/kafka-isolation-fixed-result.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: k6/kafka-isolation-test.js
        output: -

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 10m30s max duration (incl. graceful stop):
              * consumer_control: 1 iterations shared among 1 VUs (maxDuration: 10m0s, exec: consumerControlScenario, gracefulStop: 30s)
              * score_updates: 1 looping VUs for 2m30s (exec: scoreUpdateScenario, gracefulStop: 30s)


Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]

Run                [ 100% ] setup()
consumer_control   [   0% ]
score_updates      [   0% ]
time="2026-06-02T08:16:03+09:00" level=info msg="[setup] scoreIds count: 250" source=console
time="2026-06-02T08:16:03+09:00" level=info msg="[Phase 1] 정상 운영 중... (30s)" source=console

running (00m11.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m00.4s/10m0s  0/1 shared iters
score_updates      [   0% ] 1 VUs  0m00.4s/2m30s  

running (00m12.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m01.4s/10m0s  0/1 shared iters
score_updates      [   1% ] 1 VUs  0m01.4s/2m30s  

running (00m13.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m02.4s/10m0s  0/1 shared iters
score_updates      [   2% ] 1 VUs  0m02.4s/2m30s  

running (00m14.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m03.4s/10m0s  0/1 shared iters
score_updates      [   2% ] 1 VUs  0m03.4s/2m30s  

running (00m15.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m04.4s/10m0s  0/1 shared iters
score_updates      [   3% ] 1 VUs  0m04.4s/2m30s  

running (00m16.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m05.4s/10m0s  0/1 shared iters
score_updates      [   4% ] 1 VUs  0m05.4s/2m30s  

running (00m17.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m06.4s/10m0s  0/1 shared iters
score_updates      [   4% ] 1 VUs  0m06.4s/2m30s  

running (00m18.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m07.4s/10m0s  0/1 shared iters
score_updates      [   5% ] 1 VUs  0m07.4s/2m30s  

running (00m19.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m08.4s/10m0s  0/1 shared iters
score_updates      [   6% ] 1 VUs  0m08.4s/2m30s  

running (00m20.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m09.4s/10m0s  0/1 shared iters
score_updates      [   6% ] 1 VUs  0m09.4s/2m30s  

running (00m21.2s), 2/2 VUs, 3 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m10.4s/10m0s  0/1 shared iters
score_updates      [   7% ] 1 VUs  0m10.4s/2m30s  

running (00m24.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m11.4s/10m0s  0/1 shared iters
score_updates      [   8% ] 1 VUs  0m11.4s/2m30s  

running (00m25.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m12.4s/10m0s  0/1 shared iters
score_updates      [   8% ] 1 VUs  0m12.4s/2m30s  

running (00m26.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m13.4s/10m0s  0/1 shared iters
score_updates      [   9% ] 1 VUs  0m13.4s/2m30s  

running (00m27.0s), 2/2 VUs, 5 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m14.4s/10m0s  0/1 shared iters
score_updates      [  10% ] 1 VUs  0m14.4s/2m30s  

running (00m28.0s), 2/2 VUs, 5 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m15.4s/10m0s  0/1 shared iters
score_updates      [  10% ] 1 VUs  0m15.4s/2m30s  

running (00m29.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m16.4s/10m0s  0/1 shared iters
score_updates      [  11% ] 1 VUs  0m16.4s/2m30s  

running (00m30.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m17.4s/10m0s  0/1 shared iters
score_updates      [  12% ] 1 VUs  0m17.4s/2m30s  

running (00m31.0s), 2/2 VUs, 7 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m18.4s/10m0s  0/1 shared iters
score_updates      [  12% ] 1 VUs  0m18.4s/2m30s  

running (00m32.0s), 2/2 VUs, 7 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m19.4s/10m0s  0/1 shared iters
score_updates      [  13% ] 1 VUs  0m19.4s/2m30s  

running (00m33.0s), 2/2 VUs, 7 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m20.4s/10m0s  0/1 shared iters
score_updates      [  14% ] 1 VUs  0m20.4s/2m30s  

running (00m34.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m21.4s/10m0s  0/1 shared iters
score_updates      [  14% ] 1 VUs  0m21.4s/2m30s  

running (00m35.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m22.4s/10m0s  0/1 shared iters
score_updates      [  15% ] 1 VUs  0m22.4s/2m30s  

running (00m36.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m23.4s/10m0s  0/1 shared iters
score_updates      [  16% ] 1 VUs  0m23.4s/2m30s  

running (00m37.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m24.4s/10m0s  0/1 shared iters
score_updates      [  16% ] 1 VUs  0m24.4s/2m30s  

running (00m38.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m25.4s/10m0s  0/1 shared iters
score_updates      [  17% ] 1 VUs  0m25.4s/2m30s  

running (00m39.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m26.4s/10m0s  0/1 shared iters
score_updates      [  18% ] 1 VUs  0m26.4s/2m30s  

running (00m40.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m27.4s/10m0s  0/1 shared iters
score_updates      [  18% ] 1 VUs  0m27.4s/2m30s  

running (00m41.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m28.4s/10m0s  0/1 shared iters
score_updates      [  19% ] 1 VUs  0m28.4s/2m30s  

running (00m42.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m29.4s/10m0s  0/1 shared iters
score_updates      [  20% ] 1 VUs  0m29.4s/2m30s  
time="2026-06-02T08:16:35+09:00" level=info msg="[Phase 2] Consumer 중단 요청..." source=console
time="2026-06-02T08:16:35+09:00" level=info msg="[Phase 2] pause 결과: {\"status\":\"success\",\"data\":{\"score-analytics\":\"paused\",\"feedback-analytics\":\"paused\",\"counseling-analytics\":\"paused\",\"record-analytics\":\"paused\",\"risk-score\":\"paused\",\"risk-feedback\":\"paused\"}}" source=console
time="2026-06-02T08:16:35+09:00" level=info msg="[Phase 2] Consumer 중단 상태에서 성적 수정 계속... (60s)" source=console

running (00m43.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m30.4s/10m0s  0/1 shared iters
score_updates      [  20% ] 1 VUs  0m30.4s/2m30s  

running (00m44.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m31.4s/10m0s  0/1 shared iters
score_updates      [  21% ] 1 VUs  0m31.4s/2m30s  

running (00m45.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m32.4s/10m0s  0/1 shared iters
score_updates      [  22% ] 1 VUs  0m32.4s/2m30s  

running (00m46.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m33.4s/10m0s  0/1 shared iters
score_updates      [  22% ] 1 VUs  0m33.4s/2m30s  

running (00m47.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m34.4s/10m0s  0/1 shared iters
score_updates      [  23% ] 1 VUs  0m34.4s/2m30s  

running (00m48.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m35.4s/10m0s  0/1 shared iters
score_updates      [  24% ] 1 VUs  0m35.4s/2m30s  

running (00m49.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m36.4s/10m0s  0/1 shared iters
score_updates      [  24% ] 1 VUs  0m36.4s/2m30s  

running (00m50.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m37.4s/10m0s  0/1 shared iters
score_updates      [  25% ] 1 VUs  0m37.4s/2m30s  

running (00m51.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m38.4s/10m0s  0/1 shared iters
score_updates      [  26% ] 1 VUs  0m38.4s/2m30s  

running (00m52.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m39.4s/10m0s  0/1 shared iters
score_updates      [  26% ] 1 VUs  0m39.4s/2m30s  

running (00m55.5s), 2/2 VUs, 15 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m40.4s/10m0s  0/1 shared iters
score_updates      [  27% ] 1 VUs  0m40.4s/2m30s  

running (00m56.5s), 2/2 VUs, 15 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m41.4s/10m0s  0/1 shared iters
score_updates      [  28% ] 1 VUs  0m41.4s/2m30s  

running (00m57.5s), 2/2 VUs, 15 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m42.4s/10m0s  0/1 shared iters
score_updates      [  28% ] 1 VUs  0m42.4s/2m30s  

running (00m58.5s), 2/2 VUs, 15 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m43.4s/10m0s  0/1 shared iters
score_updates      [  29% ] 1 VUs  0m43.4s/2m30s  

running (00m59.5s), 2/2 VUs, 16 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m44.4s/10m0s  0/1 shared iters
score_updates      [  30% ] 1 VUs  0m44.4s/2m30s  

running (01m00.5s), 2/2 VUs, 17 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m45.4s/10m0s  0/1 shared iters
score_updates      [  30% ] 1 VUs  0m45.4s/2m30s  

running (01m01.5s), 2/2 VUs, 17 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m46.4s/10m0s  0/1 shared iters
score_updates      [  31% ] 1 VUs  0m46.4s/2m30s  

running (01m02.5s), 2/2 VUs, 17 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m47.4s/10m0s  0/1 shared iters
score_updates      [  32% ] 1 VUs  0m47.4s/2m30s  

running (01m03.5s), 2/2 VUs, 18 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m48.4s/10m0s  0/1 shared iters
score_updates      [  32% ] 1 VUs  0m48.4s/2m30s  

running (01m04.5s), 2/2 VUs, 18 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m49.4s/10m0s  0/1 shared iters
score_updates      [  33% ] 1 VUs  0m49.4s/2m30s  

running (01m05.5s), 2/2 VUs, 18 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m50.4s/10m0s  0/1 shared iters
score_updates      [  34% ] 1 VUs  0m50.4s/2m30s  

running (01m06.5s), 2/2 VUs, 19 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m51.4s/10m0s  0/1 shared iters
score_updates      [  34% ] 1 VUs  0m51.4s/2m30s  

running (01m07.5s), 2/2 VUs, 19 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m52.4s/10m0s  0/1 shared iters
score_updates      [  35% ] 1 VUs  0m52.4s/2m30s  

running (01m08.5s), 2/2 VUs, 20 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m53.4s/10m0s  0/1 shared iters
score_updates      [  36% ] 1 VUs  0m53.4s/2m30s  

running (01m09.5s), 2/2 VUs, 20 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m54.4s/10m0s  0/1 shared iters
score_updates      [  36% ] 1 VUs  0m54.4s/2m30s  

running (01m10.5s), 2/2 VUs, 21 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m55.4s/10m0s  0/1 shared iters
score_updates      [  37% ] 1 VUs  0m55.4s/2m30s  

running (01m11.5s), 2/2 VUs, 21 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m56.4s/10m0s  0/1 shared iters
score_updates      [  38% ] 1 VUs  0m56.4s/2m30s  

running (01m12.5s), 2/2 VUs, 21 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m57.4s/10m0s  0/1 shared iters
score_updates      [  38% ] 1 VUs  0m57.4s/2m30s  

running (01m13.5s), 2/2 VUs, 22 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m58.4s/10m0s  0/1 shared iters
score_updates      [  39% ] 1 VUs  0m58.4s/2m30s  

running (01m14.5s), 2/2 VUs, 22 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  00m59.4s/10m0s  0/1 shared iters
score_updates      [  40% ] 1 VUs  0m59.4s/2m30s  

running (01m15.5s), 2/2 VUs, 23 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m00.4s/10m0s  0/1 shared iters
score_updates      [  40% ] 1 VUs  1m00.4s/2m30s  

running (01m16.5s), 2/2 VUs, 23 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m01.4s/10m0s  0/1 shared iters
score_updates      [  41% ] 1 VUs  1m01.4s/2m30s  

running (01m17.5s), 2/2 VUs, 23 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m02.4s/10m0s  0/1 shared iters
score_updates      [  42% ] 1 VUs  1m02.4s/2m30s  

running (01m18.5s), 2/2 VUs, 24 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m03.4s/10m0s  0/1 shared iters
score_updates      [  42% ] 1 VUs  1m03.4s/2m30s  

running (01m19.5s), 2/2 VUs, 24 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m04.4s/10m0s  0/1 shared iters
score_updates      [  43% ] 1 VUs  1m04.4s/2m30s  

running (01m20.5s), 2/2 VUs, 24 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m05.4s/10m0s  0/1 shared iters
score_updates      [  44% ] 1 VUs  1m05.4s/2m30s  

running (01m21.5s), 2/2 VUs, 25 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m06.4s/10m0s  0/1 shared iters
score_updates      [  44% ] 1 VUs  1m06.4s/2m30s  

running (01m22.5s), 2/2 VUs, 25 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m07.4s/10m0s  0/1 shared iters
score_updates      [  45% ] 1 VUs  1m07.4s/2m30s  

running (01m23.5s), 2/2 VUs, 25 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m08.4s/10m0s  0/1 shared iters
score_updates      [  46% ] 1 VUs  1m08.4s/2m30s  

running (01m24.5s), 2/2 VUs, 26 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m09.4s/10m0s  0/1 shared iters
score_updates      [  46% ] 1 VUs  1m09.4s/2m30s  

running (01m27.6s), 2/2 VUs, 27 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m10.4s/10m0s  0/1 shared iters
score_updates      [  47% ] 1 VUs  1m10.4s/2m30s  

running (01m28.6s), 2/2 VUs, 27 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m11.4s/10m0s  0/1 shared iters
score_updates      [  48% ] 1 VUs  1m11.4s/2m30s  

running (01m29.6s), 2/2 VUs, 28 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m12.4s/10m0s  0/1 shared iters
score_updates      [  48% ] 1 VUs  1m12.4s/2m30s  

running (01m30.6s), 2/2 VUs, 28 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m13.4s/10m0s  0/1 shared iters
score_updates      [  49% ] 1 VUs  1m13.4s/2m30s  

running (01m31.6s), 2/2 VUs, 29 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m14.4s/10m0s  0/1 shared iters
score_updates      [  50% ] 1 VUs  1m14.4s/2m30s  

running (01m32.6s), 2/2 VUs, 29 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m15.4s/10m0s  0/1 shared iters
score_updates      [  50% ] 1 VUs  1m15.4s/2m30s  

running (01m33.6s), 2/2 VUs, 30 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m16.4s/10m0s  0/1 shared iters
score_updates      [  51% ] 1 VUs  1m16.4s/2m30s  

running (01m34.6s), 2/2 VUs, 30 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m17.4s/10m0s  0/1 shared iters
score_updates      [  52% ] 1 VUs  1m17.4s/2m30s  

running (01m35.6s), 2/2 VUs, 30 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m18.4s/10m0s  0/1 shared iters
score_updates      [  52% ] 1 VUs  1m18.4s/2m30s  

running (01m36.6s), 2/2 VUs, 31 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m19.4s/10m0s  0/1 shared iters
score_updates      [  53% ] 1 VUs  1m19.4s/2m30s  

running (01m37.6s), 2/2 VUs, 31 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m20.4s/10m0s  0/1 shared iters
score_updates      [  54% ] 1 VUs  1m20.4s/2m30s  

running (01m38.6s), 2/2 VUs, 32 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m21.4s/10m0s  0/1 shared iters
score_updates      [  54% ] 1 VUs  1m21.4s/2m30s  

running (01m39.6s), 2/2 VUs, 32 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m22.4s/10m0s  0/1 shared iters
score_updates      [  55% ] 1 VUs  1m22.4s/2m30s  

running (01m40.6s), 2/2 VUs, 32 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m23.4s/10m0s  0/1 shared iters
score_updates      [  56% ] 1 VUs  1m23.4s/2m30s  

running (01m41.6s), 2/2 VUs, 33 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m24.4s/10m0s  0/1 shared iters
score_updates      [  56% ] 1 VUs  1m24.4s/2m30s  

running (01m42.6s), 2/2 VUs, 33 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m25.4s/10m0s  0/1 shared iters
score_updates      [  57% ] 1 VUs  1m25.4s/2m30s  

running (01m43.6s), 2/2 VUs, 34 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m26.4s/10m0s  0/1 shared iters
score_updates      [  58% ] 1 VUs  1m26.4s/2m30s  

running (01m44.6s), 2/2 VUs, 34 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m27.4s/10m0s  0/1 shared iters
score_updates      [  58% ] 1 VUs  1m27.4s/2m30s  

running (01m45.6s), 2/2 VUs, 35 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m28.4s/10m0s  0/1 shared iters
score_updates      [  59% ] 1 VUs  1m28.4s/2m30s  

running (01m46.6s), 2/2 VUs, 36 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m29.4s/10m0s  0/1 shared iters
score_updates      [  60% ] 1 VUs  1m29.4s/2m30s  
time="2026-06-02T08:17:40+09:00" level=info msg="[Phase 2] Consumer 상태: {\"status\":\"success\",\"data\":{\"score-analytics\":{\"paused\":true,\"running\":true},\"feedback-analytics\":{\"paused\":true,\"running\":true},\"counseling-analytics\":{\"paused\":true,\"running\":true},\"record-analytics\":{\"paused\":true,\"running\":true},\"risk-score\":{\"paused\":true,\"running\":true},\"risk-feedback\":{\"paused\":true,\"running\":true}}}" source=console
time="2026-06-02T08:17:40+09:00" level=info msg="[Phase 3] Consumer 재개 요청..." source=console
time="2026-06-02T08:17:40+09:00" level=info msg="[Phase 3] resume 결과: {\"status\":\"success\",\"data\":{\"score-analytics\":\"resumed\",\"feedback-analytics\":\"resumed\",\"counseling-analytics\":\"resumed\",\"record-analytics\":\"resumed\",\"risk-score\":\"resumed\",\"risk-feedback\":\"resumed\"}}" source=console
time="2026-06-02T08:17:40+09:00" level=info msg="[Phase 3] 밀린 이벤트 처리 중... (60s)" source=console

running (01m47.6s), 2/2 VUs, 36 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m30.4s/10m0s  0/1 shared iters
score_updates      [  60% ] 1 VUs  1m30.4s/2m30s  

running (01m48.6s), 2/2 VUs, 36 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m31.4s/10m0s  0/1 shared iters
score_updates      [  61% ] 1 VUs  1m31.4s/2m30s  

running (01m49.6s), 2/2 VUs, 37 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m32.4s/10m0s  0/1 shared iters
score_updates      [  62% ] 1 VUs  1m32.4s/2m30s  

running (01m50.6s), 2/2 VUs, 37 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m33.4s/10m0s  0/1 shared iters
score_updates      [  62% ] 1 VUs  1m33.4s/2m30s  

running (01m51.6s), 2/2 VUs, 38 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m34.4s/10m0s  0/1 shared iters
score_updates      [  63% ] 1 VUs  1m34.4s/2m30s  

running (01m52.6s), 2/2 VUs, 39 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m35.4s/10m0s  0/1 shared iters
score_updates      [  64% ] 1 VUs  1m35.4s/2m30s  

running (01m53.6s), 2/2 VUs, 39 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m36.4s/10m0s  0/1 shared iters
score_updates      [  64% ] 1 VUs  1m36.4s/2m30s  

running (01m54.6s), 2/2 VUs, 40 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m37.4s/10m0s  0/1 shared iters
score_updates      [  65% ] 1 VUs  1m37.4s/2m30s  

running (01m55.6s), 2/2 VUs, 40 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m38.4s/10m0s  0/1 shared iters
score_updates      [  66% ] 1 VUs  1m38.4s/2m30s  

running (01m56.6s), 2/2 VUs, 40 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m39.4s/10m0s  0/1 shared iters
score_updates      [  66% ] 1 VUs  1m39.4s/2m30s  

running (01m59.7s), 2/2 VUs, 41 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m40.4s/10m0s  0/1 shared iters
score_updates      [  67% ] 1 VUs  1m40.4s/2m30s  

running (02m00.7s), 2/2 VUs, 41 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m41.4s/10m0s  0/1 shared iters
score_updates      [  68% ] 1 VUs  1m41.4s/2m30s  

running (02m01.7s), 2/2 VUs, 41 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m42.4s/10m0s  0/1 shared iters
score_updates      [  68% ] 1 VUs  1m42.4s/2m30s  

running (02m02.7s), 2/2 VUs, 42 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m43.4s/10m0s  0/1 shared iters
score_updates      [  69% ] 1 VUs  1m43.4s/2m30s  

running (02m03.7s), 2/2 VUs, 42 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m44.4s/10m0s  0/1 shared iters
score_updates      [  70% ] 1 VUs  1m44.4s/2m30s  

running (02m04.7s), 2/2 VUs, 43 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m45.4s/10m0s  0/1 shared iters
score_updates      [  70% ] 1 VUs  1m45.4s/2m30s  

running (02m05.7s), 2/2 VUs, 43 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m46.4s/10m0s  0/1 shared iters
score_updates      [  71% ] 1 VUs  1m46.4s/2m30s  

running (02m06.7s), 2/2 VUs, 43 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m47.4s/10m0s  0/1 shared iters
score_updates      [  72% ] 1 VUs  1m47.4s/2m30s  

running (02m07.7s), 2/2 VUs, 44 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m48.4s/10m0s  0/1 shared iters
score_updates      [  72% ] 1 VUs  1m48.4s/2m30s  

running (02m08.7s), 2/2 VUs, 44 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m49.4s/10m0s  0/1 shared iters
score_updates      [  73% ] 1 VUs  1m49.4s/2m30s  

running (02m09.7s), 2/2 VUs, 44 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m50.4s/10m0s  0/1 shared iters
score_updates      [  74% ] 1 VUs  1m50.4s/2m30s  

running (02m10.7s), 2/2 VUs, 45 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m51.4s/10m0s  0/1 shared iters
score_updates      [  74% ] 1 VUs  1m51.4s/2m30s  

running (02m11.7s), 2/2 VUs, 45 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m52.4s/10m0s  0/1 shared iters
score_updates      [  75% ] 1 VUs  1m52.4s/2m30s  

running (02m12.7s), 2/2 VUs, 45 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m53.4s/10m0s  0/1 shared iters
score_updates      [  76% ] 1 VUs  1m53.4s/2m30s  

running (02m13.7s), 2/2 VUs, 46 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m54.4s/10m0s  0/1 shared iters
score_updates      [  76% ] 1 VUs  1m54.4s/2m30s  

running (02m14.7s), 2/2 VUs, 46 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m55.4s/10m0s  0/1 shared iters
score_updates      [  77% ] 1 VUs  1m55.4s/2m30s  

running (02m15.7s), 2/2 VUs, 47 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m56.4s/10m0s  0/1 shared iters
score_updates      [  78% ] 1 VUs  1m56.4s/2m30s  

running (02m16.7s), 2/2 VUs, 48 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m57.4s/10m0s  0/1 shared iters
score_updates      [  78% ] 1 VUs  1m57.4s/2m30s  

running (02m17.7s), 2/2 VUs, 48 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m58.4s/10m0s  0/1 shared iters
score_updates      [  79% ] 1 VUs  1m58.4s/2m30s  

running (02m18.7s), 2/2 VUs, 48 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  01m59.4s/10m0s  0/1 shared iters
score_updates      [  80% ] 1 VUs  1m59.4s/2m30s  

running (02m19.7s), 2/2 VUs, 49 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m00.4s/10m0s  0/1 shared iters
score_updates      [  80% ] 1 VUs  2m00.4s/2m30s  

running (02m20.7s), 2/2 VUs, 49 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m01.4s/10m0s  0/1 shared iters
score_updates      [  81% ] 1 VUs  2m01.4s/2m30s  

running (02m21.7s), 2/2 VUs, 49 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m02.4s/10m0s  0/1 shared iters
score_updates      [  82% ] 1 VUs  2m02.4s/2m30s  

running (02m22.7s), 2/2 VUs, 50 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m03.4s/10m0s  0/1 shared iters
score_updates      [  82% ] 1 VUs  2m03.4s/2m30s  

running (02m23.7s), 2/2 VUs, 50 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m04.4s/10m0s  0/1 shared iters
score_updates      [  83% ] 1 VUs  2m04.4s/2m30s  

running (02m24.7s), 2/2 VUs, 50 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m05.4s/10m0s  0/1 shared iters
score_updates      [  84% ] 1 VUs  2m05.4s/2m30s  

running (02m25.7s), 2/2 VUs, 51 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m06.4s/10m0s  0/1 shared iters
score_updates      [  84% ] 1 VUs  2m06.4s/2m30s  

running (02m26.7s), 2/2 VUs, 52 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m07.4s/10m0s  0/1 shared iters
score_updates      [  85% ] 1 VUs  2m07.4s/2m30s  

running (02m27.7s), 2/2 VUs, 52 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m08.4s/10m0s  0/1 shared iters
score_updates      [  86% ] 1 VUs  2m08.4s/2m30s  

running (02m28.7s), 2/2 VUs, 52 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m09.4s/10m0s  0/1 shared iters
score_updates      [  86% ] 1 VUs  2m09.4s/2m30s  

running (02m31.7s), 2/2 VUs, 53 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m10.4s/10m0s  0/1 shared iters
score_updates      [  87% ] 1 VUs  2m10.4s/2m30s  

running (02m32.7s), 2/2 VUs, 53 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m11.4s/10m0s  0/1 shared iters
score_updates      [  88% ] 1 VUs  2m11.4s/2m30s  

running (02m33.7s), 2/2 VUs, 53 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m12.4s/10m0s  0/1 shared iters
score_updates      [  88% ] 1 VUs  2m12.4s/2m30s  

running (02m34.7s), 2/2 VUs, 54 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m13.4s/10m0s  0/1 shared iters
score_updates      [  89% ] 1 VUs  2m13.4s/2m30s  

running (02m35.7s), 2/2 VUs, 54 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m14.4s/10m0s  0/1 shared iters
score_updates      [  90% ] 1 VUs  2m14.4s/2m30s  

running (02m36.7s), 2/2 VUs, 55 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m15.4s/10m0s  0/1 shared iters
score_updates      [  90% ] 1 VUs  2m15.4s/2m30s  

running (02m37.7s), 2/2 VUs, 55 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m16.4s/10m0s  0/1 shared iters
score_updates      [  91% ] 1 VUs  2m16.4s/2m30s  

running (02m38.7s), 2/2 VUs, 56 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m17.4s/10m0s  0/1 shared iters
score_updates      [  92% ] 1 VUs  2m17.4s/2m30s  

running (02m39.7s), 2/2 VUs, 56 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m18.4s/10m0s  0/1 shared iters
score_updates      [  92% ] 1 VUs  2m18.4s/2m30s  

running (02m40.7s), 2/2 VUs, 56 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m19.4s/10m0s  0/1 shared iters
score_updates      [  93% ] 1 VUs  2m19.4s/2m30s  

running (02m41.7s), 2/2 VUs, 57 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m20.4s/10m0s  0/1 shared iters
score_updates      [  94% ] 1 VUs  2m20.4s/2m30s  

running (02m42.7s), 2/2 VUs, 57 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m21.4s/10m0s  0/1 shared iters
score_updates      [  94% ] 1 VUs  2m21.4s/2m30s  

running (02m43.7s), 2/2 VUs, 58 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m22.4s/10m0s  0/1 shared iters
score_updates      [  95% ] 1 VUs  2m22.4s/2m30s  

running (02m44.7s), 2/2 VUs, 58 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m23.4s/10m0s  0/1 shared iters
score_updates      [  96% ] 1 VUs  2m23.4s/2m30s  

running (02m45.7s), 2/2 VUs, 58 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m24.4s/10m0s  0/1 shared iters
score_updates      [  96% ] 1 VUs  2m24.4s/2m30s  

running (02m46.7s), 2/2 VUs, 59 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m25.4s/10m0s  0/1 shared iters
score_updates      [  97% ] 1 VUs  2m25.4s/2m30s  

running (02m47.7s), 2/2 VUs, 59 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m26.4s/10m0s  0/1 shared iters
score_updates      [  98% ] 1 VUs  2m26.4s/2m30s  

running (02m48.7s), 2/2 VUs, 59 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m27.4s/10m0s  0/1 shared iters
score_updates      [  98% ] 1 VUs  2m27.4s/2m30s  

running (02m49.7s), 2/2 VUs, 60 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m28.4s/10m0s  0/1 shared iters
score_updates      [  99% ] 1 VUs  2m28.4s/2m30s  

running (02m50.7s), 2/2 VUs, 60 complete and 0 interrupted iterations
consumer_control   [   0% ] 1 VUs  02m29.4s/10m0s  0/1 shared iters
score_updates      [ 100% ] 1 VUs  2m29.4s/2m30s  
time="2026-06-02T08:18:44+09:00" level=info msg="[완료] 테스트 종료" source=console

running (02m51.7s), 1/2 VUs, 61 complete and 0 interrupted iterations
consumer_control ✓ [ 100% ] 1 VUs  02m30.1s/10m0s  1/1 shared iters
score_updates    ↓ [ 100% ] 1 VUs  2m30s          

     ✓ score update 200
     ✓ pause 200
     ✓ resume 200

     █ setup

     checks.........................: 100.00% ✓ 63       ✗ 0  
     data_received..................: 112 kB  650 B/s
     data_sent......................: 48 kB   276 B/s
     http_req_blocked...............: avg=20.43µs  min=2.27µs   med=4.96µs   max=486.43µs p(90)=9.17µs  p(95)=14.22µs 
     http_req_connecting............: avg=8.63µs   min=0s       med=0s       max=278.3µs  p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=939.46ms min=13.6ms   med=391.73ms max=4.5s     p(90)=2.19s   p(95)=2.88s   
       { expected_response:true }...: avg=939.46ms min=13.6ms   med=391.73ms max=4.5s     p(90)=2.19s   p(95)=2.88s   
     http_req_failed................: 0.00%   ✓ 0        ✗ 116
     http_req_receiving.............: avg=835.01µs min=214.67µs med=685.4µs  max=8.58ms   p(90)=1.25ms  p(95)=1.49ms  
     http_req_sending...............: avg=59.3µs   min=15.15µs  med=58.56µs  max=137.56µs p(90)=84.78µs p(95)=101.55µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=938.56ms min=12.67ms  med=391.17ms max=4.49s    p(90)=2.19s   p(95)=2.88s   
     http_reqs......................: 116     0.672988/s
     iteration_duration.............: avg=4.94s    min=1.05s    med=2.63s    max=2m30s    p(90)=3.35s   p(95)=3.44s   
     iterations.....................: 62      0.359701/s
     score_update_count.............: 61      0.353899/s
     score_update_duration..........: avg=1.61s    min=190ms    med=1.74s    max=4.3s     p(90)=2.25s   p(95)=3.15s   
   ✓ score_update_errors............: 0.00%   ✓ 0        ✗ 61 
     vus............................: 1       min=0      max=2
     vus_max........................: 2       min=2      max=2


running (02m52.4s), 0/2 VUs, 62 complete and 0 interrupted iterations
consumer_control ✓ [ 100% ] 1 VUs  02m30.1s/10m0s  1/1 shared iters
score_updates    ✓ [ 100% ] 1 VUs  2m30s